app/controllers/interview_reports_controller.rb

  def create
    user = User.find(params[:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def show
    interview_report = InterviewReport.find_by!(share_token: params[:id])
---
SELECT  `interview_reports`.* FROM `interview_reports` WHERE `interview_reports`.`share_token` = '76460270-b62b-483a-9b48-65e932671520' LIMIT 1