app/controllers/profiles_controller.rb

  def upload_avatar
    avatar = params[:avatar]
    current_profile.update(avatar: avatar)
---
UPDATE `profiles` SET `avatar` = '20220428-163456.jpeg', `updated_at` = '2022-05-03 17:04:41' WHERE `profiles`.`id` = 1

  def upload_attachment
    attachment = params[:attachment]
    current_profile.update(attachment: attachment)
---
UPDATE `profiles` SET `attachment` = '20220428-163447.jpeg', `updated_at` = '2022-05-04 05:48:57' WHERE `profiles`.`id` = 1

  def update_english_skills
    attributes = params.permit(:english_level)
    if current_profile.update(attributes)
---
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:48:17', `steps` = '{\"projects.zh\":\"2022-05-29 23:47:39 +0800\",\"english_skills\":\"2022-05-29 23:48:17 +0800\"}' WHERE `profiles`.`id` = 1

  def update_basic
    attributes = params.permit(:country,
                               :github_url,
                               :linkedin_url,
                               :name,
                               :phone,
                               :email,
                               :weixin,
                               :self_intro)
    if current_profile.update(attributes)
---
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:48:26', `steps` = '{\"projects.zh\":\"2022-05-29 23:47:39 +0800\",\"english_skills\":\"2022-05-29 23:48:17 +0800\",\"basic\":\"2022-05-29 23:48:26 +0800\"}' WHERE `profiles`.`id` = 1

  def update_availability
    attributes = params.permit(
      :remote_work_status,
      :interested_remote_work,
      :worktime_per_week,
      :remote_work_location,
      :attitude_for_night_work,
      :lastest_of_night_work
    )
    if current_profile.update(attributes)
---
UPDATE `profiles` SET `remote_work_status` = 'accept', `interested_remote_work` = 'fulltime,parttime', `worktime_per_week` = 213, `remote_work_location` = 'inside', `attitude_for_night_work` = 'accept', `lastest_of_night_work` = 'all_time', `updated_at` = '2022-06-05 13:59:48' WHERE `profiles`.`id` = 6

  def update_technical_skills
    permitted = params.permit(:current_position, :locale, :skills => [:name, :level, :years], :industries => [])
    current_position = permitted[:current_position]
    skills = permitted[:skills]
    industries = permitted[:industries]
    locale = permitted[:locale]

    begin
      ActiveRecord::Base.transaction do
        current_profile.skills.clear
        skills.each do |attributes|
          current_profile.skills.create!(attributes)
        end

        current_profile.industries.clear
        industries.each do |industry|
          current_profile.industries.create!(name: industry, locale: locale)
        end

        current_profile.update!(current_position: current_position)
---
INSERT INTO `skills` (`profile_id`, `name`, `years`, `level`, `created_at`, `updated_at`) VALUES (1, '123', 333, 'beginner', '2022-05-04 10:38:01', '2022-05-04 10:38:01')
INSERT INTO `industries` (`profile_id`, `locale`, `name`, `created_at`, `updated_at`) VALUES (1, 'zh', '123', '2022-05-04 11:59:58', '2022-05-04 11:59:58')
UPDATE `industries` SET `industries`.`profile_id` = NULL WHERE `industries`.`profile_id` = 1
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:48:30', `steps` = '{\"projects.zh\":\"2022-05-29 23:47:39 +0800\",\"english_skills\":\"2022-05-29 23:48:17 +0800\",\"basic\":\"2022-05-29 23:48:26 +0800\",\"availability\":\"2022-05-29 23:48:28 +0800\",\"technical_skills.zh\":\"2022-05-29 23:48:30 +0800\"}' WHERE `profiles`.`id` = 1
UPDATE `skills` SET `skills`.`profile_id` = NULL WHERE `skills`.`profile_id` = 1

  def update_experience
    permitted = params.permit(
      :development_experience,
      :remote_work_experience,
      :locale,
      :works => [:position, :company, :from, :to, :description, :now],
      :educations => [:degree, :school, :from, :to],
      :certifications => [:description],
    )
    works = permitted[:works]
    educations = permitted[:educations]
    certifications = permitted[:certifications]
    development_experience = permitted[:development_experience]
    remote_work_experience = permitted[:remote_work_experience]
    locale = permitted[:locale]

    begin
      ActiveRecord::Base.transaction do
        current_profile.works.clear
        works.each do |attributes|
          attributes[:locale] = locale
          if attributes[:now]
            attributes[:to] = "1970-01-01"
          end
          current_profile.works.create!(attributes.except(:now))
        end

        current_profile.educations.clear
        educations.each do |attributes|
          attributes[:locale] = locale
          current_profile.educations.create!(attributes)
---
INSERT INTO `works` (`profile_id`, `locale`, `position`, `company`, `from`, `to`, `description`, `created_at`, `updated_at`) VALUES (1, 'zh', 'aa', 'bb', '2022-05-04', '2022-05-20', 'sss', '2022-05-04 14:57:23', '2022-05-04 14:57:23')
INSERT INTO `educations` (`profile_id`, `locale`, `degree`, `school`, `from`, `to`, `created_at`, `updated_at`) VALUES (1, 'zh', 'dfasdf', 'dafdsf', '2022-05-19', '2022-05-20', '2022-05-04 14:59:12', '2022-05-04 14:59:12')

        current_profile.certifications.clear
        certifications.each do |attributes|
          attributes[:locale] = locale
          current_profile.certifications.create!(attributes)
        end

        current_profile.update!(
          development_experience: development_experience,
          remote_work_experience: remote_work_experience,
        )
---
INSERT INTO `certifications` (`profile_id`, `locale`, `description`, `created_at`, `updated_at`) VALUES (1, 'zh', '123123', '2022-05-04 15:03:22', '2022-05-04 15:03:22')
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:50:40', `steps` = '{\"english_skills\":\"2022-05-29 23:50:33 +0800\",\"basic\":\"2022-05-29 23:50:35 +0800\",\"availability\":\"2022-05-29 23:50:36 +0800\",\"technical_skills.zh\":\"2022-05-29 23:50:37 +0800\",\"experience.zh\":\"2022-05-29 23:50:40 +0800\"}' WHERE `profiles`.`id` = 1
UPDATE `works` SET `works`.`profile_id` = NULL WHERE `works`.`profile_id` = 1

  def update_projects
    permitted = params.permit(
      :locale,
      :projects => [:name, :description, :url, skills: []],
    )
    projects = permitted[:projects]
    locale = permitted[:locale]

    begin
      ActiveRecord::Base.transaction do
        current_profile.projects.clear
        projects.each do |attributes|
          attributes[:locale] = locale
          current_profile.projects.create!(attributes)
---
INSERT INTO `projects` (`profile_id`, `locale`, `name`, `description`, `url`, `created_at`, `updated_at`, `skills`) VALUES (1, 'zh', '123', '456', 'sss', '2022-05-04 16:41:51', '2022-05-04 16:41:51', '[\"b\", \"a\"]')

  def update_web_three
    attributes = params.permit(:attitude_for_web_three, :experience_for_web_three, :understand_web_three, :reason_for_web_three)
    if current_profile.update(attributes)
---
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:50:43', `steps` = '{\"english_skills\":\"2022-05-29 23:50:33 +0800\",\"basic\":\"2022-05-29 23:50:35 +0800\",\"availability\":\"2022-05-29 23:50:36 +0800\",\"technical_skills.zh\":\"2022-05-29 23:50:37 +0800\",\"experience.zh\":\"2022-05-29 23:50:40 +0800\",\"projects.zh\":\"2022-05-29 23:50:41 +0800\",\"web_three\":\"2022-05-29 23:50:43 +0800\"}' WHERE `profiles`.`id` = 1

  def update_salary
    attributes = params.permit(:basic_salary, :bonus_min, :bonus_max, :stock, :other_salary, :expect_salary_per_hour, :expect_salary_per_year)
    if current_profile.update(attributes)
---
UPDATE `profiles` SET `updated_at` = '2022-05-29 15:50:45', `steps` = '{\"english_skills\":\"2022-05-29 23:50:33 +0800\",\"basic\":\"2022-05-29 23:50:35 +0800\",\"availability\":\"2022-05-29 23:50:36 +0800\",\"technical_skills.zh\":\"2022-05-29 23:50:37 +0800\",\"experience.zh\":\"2022-05-29 23:50:40 +0800\",\"projects.zh\":\"2022-05-29 23:50:41 +0800\",\"web_three\":\"2022-05-29 23:50:43 +0800\",\"salary\":\"2022-05-29 23:50:45 +0800\"}' WHERE `profiles`.`id` = 1