app/controllers/recruiter_forms_controller.rb

INSERT INTO `recruiter_forms` (`company`, `email`, `headcount`, `hire_positions`, `name`, `phone`, `position`, `staff_count`, `website`, `wechat`, `created_at`, `updated_at`) VALUES ('safas', 'sfasf', '21_30', 'fullstack_be,mobile', 'fasf', 'sadfasf', 'senior_manager', '51_100', 'safsaf', 'asdfa', '2022-05-15 15:19:53', '2022-05-15 15:19:53')
---
  def create
    fields = params.permit(
      :company,
      :email,
      :headcount,
      :hire_positions,
      :name,
      :phone,
      :position,
      :staff_count,
      :website,
      :wechat,
    )

    form = RecruiterForm.new(fields)

    if form.save