app/controllers/upload_files_controller.rb

INSERT INTO `upload_files` (`file`, `created_at`, `updated_at`) VALUES ('Invoice_Wang_Minyi_2021.pdf', '2022-06-20 18:26:50', '2022-06-20 18:26:50')
---
  def create
    fields = params.permit(
      :file
    )

    upload_file = UploadFile.new(fields)

    if upload_file.save