app/controllers/users_controller.rb

  def send_verification_code
    phone = params[:phone]
    type = params[:type]
    valid = true
    error_code = 0

    if !phone.match(/[0-9]{11}/).present?
      valid = false
      error_code = 100001
    elsif type === "sign_in" && !User.exists?(phone: phone)
      valid = false
      error_code = 100002
    end

    if !valid
      render json: {
        code: error_code,
      }
    elsif ConfirmationCode.create(phone: phone, event_type: type, code: 6.times.map { |x| (rand() * 10).floor }.join(""))
---
SELECT  1 AS one FROM `users` WHERE `users`.`phone` = '12312312322' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`phone` = '12312312322' LIMIT 1
INSERT INTO `confirmation_codes` (`phone`, `code`, `event_type`, `created_at`, `updated_at`) VALUES ('13636329282', 'landd', 'sign_up', '2022-05-02 09:43:58', '2022-05-02 09:43:58')

  def sign_up
    phone = params[:phone]
    code = params[:code]
    token = params[:token]
    role = params[:role]
    if !ConfirmationCode.exists?(phone: phone, code: code, event_type: "sign_up")
      render json: {
        code: 100001,
        message: "验证码不正确",
      }
    elsif User.exists?(phone: phone)
      render json: {
        code: 100002,
        message: "手机已被注册",
      }
    elsif token.present? && (recommend_token = RecommendToken.find_by(token: params[:token])).blank?
      render json: {
        code: 100003,
        message: "邀请码错误",
      }
    else
      user = User.new(phone: phone, email: "#{phone}@landd.co", password: phone, role: role)
      user.skip_confirmation_notification!
      if user.save
        if recommend_token.present?
          recommend_token.recommend_records.create!(user_id: recommend_token.user_id, recommend_user_id: user.id)
---
SELECT  1 AS one FROM `confirmation_codes` WHERE `confirmation_codes`.`phone` = '' AND `confirmation_codes`.`code` IN ('1', '5', '8', '4', '1', '1') AND `confirmation_codes`.`event_type` = 'sign_up' LIMIT 1
SELECT  1 AS one FROM `users` WHERE `users`.`phone` = '13636329282' LIMIT 1
SELECT  `recommend_tokens`.* FROM `recommend_tokens` WHERE `recommend_tokens`.`token` = 'b764cd948b36c77e6080c6a3083ff8d0' LIMIT 1
INSERT INTO `users` (`email`, `encrypted_password`, `confirmation_token`, `confirmation_sent_at`, `created_at`, `updated_at`, `phone`, `role`) VALUES ('12312312317@landd.co', '$2a$12$LW/RzcqjOiotHQtFFiVcfu5P2ZI4hJOaFDp85BDUoWhwkGi5sZKqS', 'WTK2guQJnfeu2wLSyVRp', '2022-06-11 16:21:15', '2022-06-11 16:21:15', '2022-06-11 16:21:15', '12312312317', 'recommend')
INSERT INTO `recommend_records` (`user_id`, `recommend_user_id`, `recommend_token_id`, `created_at`, `updated_at`) VALUES (1, 11, 1, '2022-06-11 16:06:30', '2022-06-11 16:06:30')
INSERT INTO `recommend_tokens` (`user_id`, `token`, `created_at`, `updated_at`) VALUES (6, 'bb0af9f585b28874f8a9887a33774123', '2022-06-05 13:56:44', '2022-06-05 13:56:44')

  def sign_in_by_code
    phone = params[:phone]
    code = params[:code]
    if !ConfirmationCode.exists?(phone: phone, code: code, event_type: "sign_in")
      render json: {
        code: 100001,
        message: "验证码不正确",
      }
    else
      user = User.find_by(phone: phone)
---
SELECT  1 AS one FROM `confirmation_codes` WHERE `confirmation_codes`.`phone` = '13636329282' AND `confirmation_codes`.`code` = 'landd' AND `confirmation_codes`.`event_type` = 'sign_in' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`phone` = '13636329282' LIMIT 1

  def recommend_token
    if current_user.recommend_tokens.count == 0
      current_user.create_recommend_token
    end

    render json: {
      code: 0,
      data: {
        token: current_user.recommend_tokens.first&.token,
      },
    }
---
SELECT COUNT(*) FROM `recommend_tokens` WHERE `recommend_tokens`.`user_id` = 1
INSERT INTO `recommend_tokens` (`user_id`, `token`, `created_at`, `updated_at`) VALUES (1, 'b764cd948b36c77e6080c6a3083ff8d0', '2022-06-05 10:47:34', '2022-06-05 10:47:34')
SELECT  `recommend_tokens`.* FROM `recommend_tokens` WHERE `recommend_tokens`.`user_id` = 1 ORDER BY `recommend_tokens`.`id` ASC LIMIT 1

  def recommend_records
    render json: {
      code: 0,
      data: {
        recommend_records: current_user.recommend_records.preload(recommend_user: :profile).map do |record|
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1 LIMIT 1
SELECT `recommend_records`.* FROM `recommend_records` WHERE `recommend_records`.`user_id` = 1